{"data":{"allWordpressPost":{"nodes":[{"slug":"javascript-multidimensional-array","title":"JavaScript Multidimensional Array","excerpt":"<p>Arrays provide a great way to organize related data together. In programming languages, like JavaScript, the simplest form of an array is known as a one-dimensional array or single-dimensional array. But, most of the time, we require to store multiple types of data for each element of an array. Here, JavaScript introduces the concept of [&hellip;]</p>\n","featured_media":{"source_url":"https://codingsrc.com/wp-content/uploads/2020/04/javascript-multidimensional-array.png","slug":"javascript-multidimensional-array-2"}},{"slug":"node-js-tutorial-for-begginers-in-visual-studio-code","title":"Node.js Tutorial for Beginners in Visual Studio Code","excerpt":"<p>With the evolution of web development, faster and better technologies are coming day by day to enhance our workflow. Node.js is one of them. Previously, JavaScript programming language was only restricted inside a client-side web browser environment. But with the advent of Node.js, it provides us the ability to execute JavaScript code on the server. [&hellip;]</p>\n","featured_media":{"source_url":"https://codingsrc.com/wp-content/uploads/2020/03/COVER.png","slug":"cover"}},{"slug":"how-to-use-node-js-express-middleware-in-your-web-application","title":"How to Use Node.js Express Middleware in your Web Application?","excerpt":"<p>Middleware plays an important role when building Node web applications using Express framework. Simply put, you cannot build an Express application without incorporating middleware. So, the possibility is, knowingly or unknowingly, you have used middleware in your Express applications before. Then, it’s high time that you get to know what exactly middleware is and how [&hellip;]</p>\n","featured_media":{"source_url":"https://codingsrc.com/wp-content/uploads/2020/03/nodejs-express-middleware.png","slug":"nodejs-express-middleware"}},{"slug":"node-js-express-hbs-tutorial-handlebars","title":"Node.js Express hbs Tutorial (Handlebars)","excerpt":"<p>Most of the time when we start working on a web project, then it quickly gets complex as we write more and more code. In the beginning, if we don’t structure our code efficiently then it will most probably affect the scalability of our application in later stages. A good starting point is to separate [&hellip;]</p>\n","featured_media":{"source_url":"https://codingsrc.com/wp-content/uploads/2020/03/hbs-tutorial.png","slug":"hbs-tutorial"}},{"slug":"eslint-prettier-create-react-app-best-configuration-setup-2019","title":"Eslint Prettier Create React App Best Configuration Setup [2019]","excerpt":"<p>Have you ever wanted to configure Eslint to work correctly with Prettier and your Create React App? If so in this video you will learn the best settings to do that. Steps: 1.Install Eslint Globally npm i -g eslint 2. Open your create-react-app react project or create one by typing npx create-react-app name-of-project (needs npm [&hellip;]</p>\n","featured_media":{"source_url":"https://codingsrc.com/wp-content/uploads/2019/11/Eslint-Prettier-Create-React-App-2019-Cover.png","slug":"eslint-prettier-create-react-app-2019-cover"}},{"slug":"solidity-tutorial","title":"Solidity Tutorial &#8211; Intro To Solidity Programming Language","excerpt":"<p>In this lecture we are going to talk about contracts, constructors and functions. OK, let’s dive right in. Let’s first see what is the structure of a solidity source file. Here we can see a sample contract. On the top of every solidity file there is the so called version pragma, which tells us the [&hellip;]</p>\n","featured_media":{"source_url":"https://codingsrc.com/wp-content/uploads/2019/06/1.jpg","slug":"1"}},{"slug":"why-learn-solidity-5-benefits-of-learning-solidity-today","title":"Why Learn Solidity? 5 Benefits Of Learning Solidity Today!","excerpt":"<p>Yesterday I was SHOCKED to find out that some of my students haven&#8217;t even started my bestselling course Solidity Smart Contracts: Build DApps In Ethereum Blockchain and they have already got enrolled I understand that some of you might have decided to get it and start at some point in the future&#8230; However, the sooner you learn [&hellip;]</p>\n","featured_media":{"source_url":"https://codingsrc.com/wp-content/uploads/2019/05/ezgif.com-gif-maker-1.gif","slug":"ezgif-com-gif-maker-2"}},{"slug":"vscode-sync-settings-and-extensions-tutorial-synchronize-devices","title":"VSCode Sync Settings and Extensions Tutorial &#8211; Synchronize Devices!","excerpt":"<p>Isn&#8217;t it a nightmare to switch from your P.C. to your laptop and you don&#8217;t have any of the Visual Studio Extension snippets and settings. If you want to know how to sync your visual studio across multiple devices in this article you will learn how to do that. So the best way that I [&hellip;]</p>\n","featured_media":{"source_url":"https://codingsrc.com/wp-content/uploads/2019/05/VSCODE-SYNC-SETTINGS-AND-EXTENSIONS.jpg","slug":"vscode-sync-settings-and-extensions"}},{"slug":"heroku-tutorial-for-beginners","title":"Heroku Tutorial For Beginners &#8211; Deploy Your App to Heroku Under 5 Minutes!","excerpt":"<p>If you don’t know already Heroku is a cloud platform as a service supporting several programming languages. You can deploy projects written in many kinds of languages in there. They support NodeJS, Ruby, Java, Php, Python and other languages and the best part is that they have a free plan. So, now let’s go to heroku.com and [&hellip;]</p>\n","featured_media":{"source_url":"https://codingsrc.com/wp-content/uploads/2018/10/HerokuTutorial.jpg","slug":"herokututorial"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}